import json

data = {
"Петров": {
      "1": ['Нет', 'Нет', ". 2+2"],
      "2": ['Нет', 'Нет', ". 3+3"],
      "3": ['нет', 'нет', ". 4+4"],
      "4": ['нет', 'нет', ". 5+5"],
      "5": ['нет', 'нет', ". 6+6"],
      "6": ['нет', 'нет', ". 7+7"],
      "7": ['нет', 'нет', ". 8+8"],
      "8": ['нет', 'нет', ". 9+9"],
      "9": ['нет', 'нет', ". 10+10"],
      "10": ['нет', 'нет', ". 11+11"]
  },
"Иванов": {
      "1": ['Нет', 'Нет', ". 2+2"],
      "2": ['Нет', 'Нет', ". 3+3"],
      "3": ['нет', 'нет', ". 4+4"],
      "4": ['нет', 'нет', ". 5+5"],
      "5": ['нет', 'нет', ". 6+6"],
      "6": ['нет', 'нет', ". 7+7"],
      "7": ['нет', 'нет', ". 8+8"],
      "8": ['нет', 'нет', ". 9+9"],
      "9": ['нет', 'нет', ". 10+10"],
      "10": ['нет', 'нет', ". 11+11"]
  },
"Сергеев": {
      "1": ['Нет', 'Нет', ". 2+2"],
      "2": ['Нет', 'Нет', ". 3+3"],
      "3": ['нет', 'нет', ". 4+4"],
      "4": ['нет', 'нет', ". 5+5"],
      "5": ['нет', 'нет', ". 6+6"],
      "6": ['нет', 'нет', ". 7+7"],
      "7": ['нет', 'нет', ". 8+8"],
      "8": ['нет', 'нет', ". 9+9"],
      "9": ['нет', 'нет', ". 10+10"],
      "10": ['нет', 'нет', ". 11+11"]
  },
"Васильев": {
      "1": ['Нет', 'Нет', ". 2+2"],
      "2": ['Нет', 'Нет', ". 3+3"],
      "3": ['нет', 'нет', ". 4+4"],
      "4": ['нет', 'нет', ". 5+5"],
      "5": ['нет', 'нет', ". 6+6"],
      "6": ['нет', 'нет', ". 7+7"],
      "7": ['нет', 'нет', ". 8+8"],
      "8": ['нет', 'нет', ". 9+9"],
      "9": ['нет', 'нет', ". 10+10"],
      "10": ['нет', 'нет', ". 11+11"]
  }

}



with open("../Date/data_file.json", "w") as write_file:
    json.dump(data, write_file)


with open('../Date/data_file.json') as f:
    d = json.load(f)
    name = input('Введите фамилию')
    for key, value in d[name].items():
        print(key, value[2])
    nomer_zadahi = input('Введите номер задачи на которую дадите ответ')

    print(d['Васильев'][nomer_zadahi][0])

    otvet = input('ответ')
    d['Васильев'][nomer_zadahi][0] = otvet
    print(d['Васильев'][nomer_zadahi][0])

with open("../Date/data_file.json", "w") as write_file:
    json.dump(data, write_file)